app/views/companies/show.html.erb


<% if @company.workers.count > 0 %>
---
SELECT "workers".* FROM "workers" WHERE "workers"."company_id" = ?  [["company_id", 2]]
SELECT COUNT(*) FROM "workers" WHERE "workers"."company_id" = ?  [["company_id", 4]]