app/controllers/api/v1/companies_controller.rb

      def show
        @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def create
        @company = Company.create(company_params)
---
INSERT INTO "companies" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test name"], ["description", "test desc"], ["created_at", "2018-05-11 22:11:14.779745"], ["updated_at", "2018-05-11 22:11:14.779745"]]

      def update
        @company = Company.find(params[:id])

        if @company.update(company_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "qwerty"], ["updated_at", "2018-05-08 09:11:50.610092"], ["id", 2]]

      def destroy
        @company = Company.find(params[:id])
        @company.destroy
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]