app/controllers/api/v1/workers_controller.rb

SELECT "workers".* FROM "workers"
---
      def index
        @workers = Worker.all

INSERT INTO "workers" ("name", "description", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "name"], ["description", "desc"], ["company_id", 2], ["created_at", "2018-05-11 21:46:51.548576"], ["updated_at", "2018-05-11 21:46:51.548576"]]
---
      def create
        workers
        @worker = @workers.create(workers_param)

UPDATE "workers" SET "name" = ?, "updated_at" = ? WHERE "workers"."id" = ?  [["name", "Lazio Bene"], ["updated_at", "2018-05-11 22:23:17.870106"], ["id", 6]]
---
      def update
        worker
        @worker.update(workers_param)

DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 6]]
---
      def destroy
        worker
        @worker.destroy

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "workers" SET "company_id" = ?, "updated_at" = ? WHERE "workers"."id" = ?  [["company_id", 3], ["updated_at", "2018-05-11 21:25:09.416361"], ["id", 6]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      def send_to_company
        @worker = Worker.find(params[:worker_id])
        @worker.update(company_id: params[:new_id])
        @new_company = Company.find(params[:new_id])

SELECT  "workers".* FROM "workers" WHERE "workers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
      def another_company_list
        @worker = Worker.find(params[:worker_id])
        @companies = Company.where.not(id: @worker.company_id)