app/views/workers/_worker.html.erb

  <%= link_to "Delete worker", [worker.company, worker], method: :delete, data: { confirm: "Are you sure?"} %><br>
  <% if current_user.companies.count > 1 %>
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 2]]