app/views/workers/another_company_list.html.erb

SELECT  "workers".* FROM "workers" WHERE "workers"."company_id" = ? AND "workers"."id" = ? LIMIT ?  [["company_id", 4], ["id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "workers" WHERE "workers"."company_id" = ?  [["company_id", 4]]
---
    In  <%= link_to "#{company.name}", workers_send_to_company_path(company_id: @worker.company_id, worker_id: @worker.id, :new_id => company.id) %> worked
    <%= company.workers.count %> workers <br>