app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? ORDER BY "companies"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
  def index
    @user = current_user
    @companies = @user.companies.all

SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = current_user
    @company = @user.companies.find(params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @company = Company.find(params[:id])

INSERT INTO "companies" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "company_1"], ["description", "description1"], ["user_id", 1], ["created_at", "2018-04-26 12:14:40.140387"], ["updated_at", "2018-04-26 12:14:40.140387"]]
---
  def create
    @user = current_user
    @company = @user.companies.new(company_params)
    if @company.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "companies" SET "description" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["description", "updated description"], ["updated_at", "2018-04-17 19:42:16.817652"], ["id", 1]]
---
  def update
    @company = Company.find(params[:id])

    if @company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 1]]
---
  def destroy
    @company = Company.find(params[:id])
    @company.destroy