app/controllers/workers_controller.rb

  def new
    @company = Company.find(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @company = Company.find(params[:company_id])
    @worker = @company.workers.create(workers_param)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "workers" ("name", "description", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "work1"], ["description", "desc1"], ["company_id", 2], ["created_at", "2018-04-17 21:01:33.538717"], ["updated_at", "2018-04-17 21:01:33.538717"]]

  def destroy
    @company = Company.find(params[:company_id])
    @worker = @company.workers.find(params[:id])
    @worker.destroy
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "workers".* FROM "workers" WHERE "workers"."company_id" = ? AND "workers"."id" = ? LIMIT ?  [["company_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 1]]

  def send_to_company
    @company = Company.find(params[:company_id])
    @worker = @company.workers.find(params[:worker_id])
    @worker.update(company_id: params[:new_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "workers".* FROM "workers" WHERE "workers"."company_id" = ? AND "workers"."id" = ? LIMIT ?  [["company_id", 5], ["id", 7], ["LIMIT", 1]]
UPDATE "workers" SET "company_id" = ?, "updated_at" = ? WHERE "workers"."id" = ?  [["company_id", 6], ["updated_at", "2018-04-23 21:17:16.081890"], ["id", 6]]

  def another_company_list
    @company = Company.find(params[:company_id])
    @worker = @company.workers.find(params[:worker_id])
    @companies = Company.where.not(id: params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "workers".* FROM "workers" WHERE "workers"."company_id" = ? AND "workers"."id" = ? LIMIT ?  [["company_id", 4], ["id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "workers" WHERE "workers"."company_id" = ?  [["company_id", 4]]
SELECT "companies".* FROM "companies"