app/controllers/workers_controller.rb

  def another_company_list
    workers
    @worker = @workers.find(params[:worker_id])
    @companies = current_user.companies.where.not(id: params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? AND "companies"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]